package part3;

// Создать программу, проверяющую и сообщающую на экран, является ли целое число записанное в переменную n, чётным либо нечётным.
public class Task1 {
    public static void main(String[] args) {
        int n = -55;
        if (n >= 0)
            System.out.println("n is even");
        else
            System.out.println("n isn't even");
    }
}
